Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: ཡིད་ཀྱི་དབང་པོ་ཐམས་ཅད་ཀྱི་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་བྱེད་པ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཐམས་ཅད་ཀྱི་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་བྱེད་པ། སྤོང་བར་བྱེད་པ།
en: It induces genuine understanding and abandonment of all the aggregates, the elements, and the sense sources.

source: ཆོས་ཐམས་ཅད་འདོད་ཆགས་དང་བྲལ་བར་བྱེད་པ། བྱང་གྲོལ་གྱི་བདེ་བ་ཐམས་ཅད་སྟོན་པར་བྱེད་པ་འདི་བསྐུར་བར་མཛད་དོ།
en: It liberates from desire related to any phenomenon, and it reveals the complete happiness of emancipation.

source: དེ་དང་དེ་ན་སེམས་ཅན་རྣམས་འབྱུང་པོ་དམུས་ལོང་འདྲ་བ་དག་དང་། མཆོག་ཏུ་གླེན་པ་དག་དང་། འབྱུང་པོ་ལུག་དང་འདྲ་བ་དག་དང་། འདོད་པའི་འདོད་ཆགས་ཀྱིས་མྱོས་པ་དག་ཡོད་དེ།
en: Because in those lands there are sentient beings who are like blind creatures, who are completely dull, who are like sheep, and who are intoxicated by sensual desire.

source: བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་འདི་ནི་སེམས་ཅན་དེ་དག་གི་ལྟ་བ་ཐམས་ཅད་སྤོང་བ་དང་། ལོངས་སྤྱོད་མི་ཟད་པ་ཉིད་བྱེད་པ་ཡིན།
en: This acceptance that accords with the truth eliminates all the views of those sentient beings and provides them with inexhaustible enjoyment.

source: བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་གཏེར་བརྟན་པ་ཡིན།
en: This acceptance that accords with the truth is the steadfast treasure of the entire Dharma.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་ལ་བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅོད་པར་བྱེད་པ། བདུད་ཐམས་ཅད་ཀྱི་ཡུལ་རྣམ་པར་འཇིག་པར་བྱེད་པ་ཡིན་ནོ།
en: It subjugates all māras and enemies by converting them to the inconceivable Dharma, and it destroys the domain of all the māras.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་འདི་ནི་བདུད་རྣམས་ཚར་གཅོད་པར་བྱེད་པ་ཡིན། ཀླུ་རྣམས་ཕམ་པར་བྱེད་པ་ཡིན།
en: Furthermore, noble son, this acceptance that accords with the truth annihilates the māras and defeats the nāgas.

source: ལྷ་རྣམས་དགའ་བར་བྱེད་པ་ཡིན། གནོད་སྦྱིན་རྣམས་སྙིང་དགའ་བར་བྱེད་པ་ཡིན། ལྷ་མ་ཡིན་རྣམས་འབྲོས་པར་བྱེད་པ་ཡིན། ནམ་མཁའ་ལྡིང་རྣམས་དངང་བར་བྱེད་པ་ཡིན། མི་འམ་ཅི་རྣམས་དད་པར་བྱེད་པ་ཡིན། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་སྐྲག་པར་བྱེད་པ་ཡིན།
en: It delights the gods, it pleases the hearts of the yakṣas, it causes the asuras to run away, it frightens the garuḍas, it generates faith in the kinnaras, and it terrifies the mahoragas.

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་འདུལ་བར་བྱེད་པ་ཡིན། རྒྱལ་རིགས་རྣམས་མངོན་པར་དད་པར་བྱེད་པ་ཡིན། བྲམ་ཟེ་རྣམས་འཇུག་པར་བྱེད་པ་ཡིན། རྗེའུ་རིགས་རྣམས་དགའ་བར་བྱེད་པ་ཡིན། དམངས་རིགས་རྣམས་དགའ་བར་བྱེད་པ་ཡིན།
en: It subjugates the enemies, it generates sincere faith in the members of the kṣatriya class, it attracts the brāhmaṇas, and it pleases the vaiśyas and the śūdras.

source: བུད་མེད་འདོད་ཆགས་དང་བྲལ་བར་བྱེད་པ་ཡིན། མང་དུ་ཐོས་པ་རྣམས་སྐྱོ་བར་བྱེད་པ་ཡིན། རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་མངོན་པར་དགའ་བར་བྱེད་པ་ཡིན། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་ཡིན།
en: It frees women from their desires, it engenders weariness in the scholars, it delights the spiritual practitioners, and it cures all diseases.

source: ཐབ་མོ་དང་། མུ་གེ་དང་། དུས་མ་ཡིན་པར་འཆི་བ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། དུས་མ་ཡིན་པའི་ཆར་དང་། ཤྭ་དང་། དུས་མ་ཡིན་པའི་ལྷགས་པ་དང་། དུས་མ་ཡིན་པའི་ཚ་བ་དང་། དངོས་པོ་ཁ་བ་དང་། ཚ་བ་དང་། རྩུབ་པོ་དང་། ཧྲུད་ཧྲུད་པོ་དང་། རེག་པར་དཀའ་བ་རྣམས་རྣམ་པར་ཞི་བར་བྱེད་པ། སྤྲུག་པར་བྱེད་པ།
en: It pacifies and eliminates all struggle, famine, untimely death, hostile armies, untimely storms, untimely rain and flooding, untimely hurricanes, untimely warm weather, snow, and heat waves, and it softens and purifies all substances that are harsh, rough, and hard to touch.

source: མདངས་སུམ་འགྱུར་དུ་རྣམ་པར་འཕེལ་བར་བྱེད་པ། དམ་པའི་ཆོས་ཀྱི་ཚུལ་གསལ་བར་བྱེད་པ་ཡིན། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅོད་པར་བྱེད་པ་ཡིན། སངས་རྒྱས་ཀྱི་བསྟན་པ་རྟོན་པར་བྱེད་པ་ཡིན།
en: It expands direct perception, clarifies the way of the sacred Dharma, ensures that the lineage of the Three Jewels remains uninterrupted, and causes one to adhere to the teachings of the Buddha.

source: འཁོར་བས་སྐྲག་པ་རྣམས་དབུགས་འབྱིན་པར་བྱེད་པ་ཡིན་པ་ནས། ཟད་པ་ཤེས་པའི་བར་སྐྱེད་པར་བྱེད་པ་ཡིན། མི་སྐྱེ་བ་ཤེས་པ་རྟོགས་པར་བྱེད་པ་ཡིན། མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པར་བྱེད་པ་ཡིན། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བྱེད་པ་ཡིན་ནོ། །
en: It provides relief to those who are afraid of saṃsāra, generates the knowledge of exhaustion, causes one to realize the knowledge of the unborn, overcomes all the dense darkness of ignorance, and removes the burden of suffering.

source: སྱཱད་ཡ་ཐེ་ད་ན། བ་ཡེ་བ་ཡ་པ་རི་བཱ་རེ། བཱ་ཧེ་བཱ་ཧ་པ་རི་བཱ་རེ། པྲཱི་ཐ་བེ། པྲཱི་ཐ་བཱ་པ་རི་བཱ་རེ། ཨཱ་བེ་ཨཱ་བ་པ་རི་བཱ་རེ། ཏེ་ཛེ་ཏེ་ཛ་པ་རི་བཱ་རེ། མཱ་ལེ་མཱ་ལ་པ་རི་བཱ་རེ། ཁ་གེ་ཁ་ག་པ་རི་པཱ་རི། ཨཱ་ལོ་ཀེ་ཨཱ་ལོ་ཀ་པ་རི་བཱ་རེ། སྠཱ་མེ་སྠཱ་མ་པ་རི་བཱ་རེ། རི་ཛེ་རི་ཛ་པ་རི་བཱ་རེ། སི་ལེ་སི་ལ་པ་རི་བཱ་རེ། ག་མེ་ག་མ་པ་རི་བཱ་རེ། ཨཱ་བོ་པ་ཨ་བོ་པ་པ་རི་བཱ་རེ། མཱ་ལ་མ་ལ་མ། ལ་མ་ལ་མ། རཱ་ལ་རཱ་ལ་མ། བཱི་ཛྙཱ་ན་བྷཱུ་ཏ་གྲ་ཧེ། བྷཱུ་ཏ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཙཀྵུ་གྲ་ཧ་པ་རི་བཱ་རེ། ཤོ་ཏྲ་གྲ་ཧེ། ཤོ་ཏྲ་གྲ་ཧཱ་པ་རི་བཱ་རེ། གྷྲཱ་ཎ་གྲ་ཧེ། གྷྲཱ་ཎ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཛི་ཧྭཱ་གྲ་ཧེ། ཛི་ཧྭཱ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཀཱ་ཡ་གྲ་ཧེ། ཀཱ་ཡ་གྲ་ཧཱ་པ་རི་བཱ་རེ། མན་གྲ་ཧེ། མན་གྲ་ཧཱ་པ་རི་བཱ་རེ། སྤརྴ་གྲ་ཧེ། སྤརྴ་གྲ་ཧཱ་པ་རི་བཱ་རེ། བེ་ད་ནཱ་གྲ་ཧེ། བེ་ད་ནཱ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཏྲཱིཥྞཱ་གྲ་ཧེ། ཏྲཱིཥྞཱ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཨུ་པཱ་དཱ་ན་གྲ་ཧེ། ཨུ་པཱ་དཱ་ན་གྲ་ཧཱ་པ་རི་བཱ་རེ། བྷཱ་བ་གྲ་ཧེ། བྷཱ་བ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཛཱ་ཏི་གྲ་ཧེ། ཛ་ར་མར་ཎ་གྲ་ཧེ། ཛ་ར་མ་ར་ཎ་གྲ་ཧཱ་པ་རི་བཱ་རེ། དུཿཁ་སན་ཏ་པཱ་ན་གྲ་ཧེ། དུཿཁ་སན་ཏ་པཱ་ན་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཨཱ་ར་པཱ་ར་དྭི་ཛ་གྲ་ཧེ། ཨཱ་ར་པཱ་ར་དྭི་ཛ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཨ་བརྟ་བི་བརྟ་སྱ། ཨ་བ་ར་མུ་པ་མ་ས་སྱ། བེ་ག་བི་ནི། བརྟི་ཨཱ་རྱ་ར་སྨི་སཾ་བེ་ག་ཤཱན་ཏི་སྭཱ་ཧཱ།
en: syād yathedaṃ: vayevaya­parivāre vāhevāha­parivāre pṛthave pṛthavāparivāre āve āva parivāre tejeteja­parivāre mālemāla­parivāre khagekhaga­parivāri āloke āloka parivāre sthāmesthāma­parivāre rijerija­parivāre silesila­parivāre gamegama­parivāre āvopa avopa­parivāre mālamalama lamalama rālarālama vijñāna­bhūtagrahe bhūta­grahāparivāre cakṣugraha­parivāre śotragrahe śotra­grahāparivāre ghrāṇagrahe grāṇagrahā­parivāre jihvāgrahe jihvāgrahāparivāre kāyagrahe kāyagrahā­parivāre mangrahe mangrahā­parivāre sparśagrahe sparśa­grahāparivāre vedanāgrahe vedanāgrahā­parivāre tṛṣṇāgraha tṛṣṇāgrahā­parivāre upādānagrahe upādāna­grahāparivāre bhāvagrahe bhāva­grahāparivāre jātigrahe jāti­grahāparivāre jaramaraṇa­grahe jaramaraṇa­grahāparivāre duḥkhas antapāna­grahe duḥkhas antapāna­grahāparivāre ārapāradvijagrahe ārapāradvija­grahāparivāre avṛtavi­vṛtasya avaramu­pamasasya vegavini vṛti āryar asmi saṃve­gaśānti svāhā.

source: རིགས་ཀྱི་བུ་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་འདི་ལ་ངས་དད་པ་སྦྱིན་པར་མཛད་ཅིང་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་བསྐུར་བར་མཛད་ཀྱིས་ལོང་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་སོང་ཤིག །
en: “Noble son, with this practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the nāgas, the dhāraṇī that exhausts the karmic actions of sentient beings, I will instill faith in others and confer upon them the acceptance that accords with the truth. Therefore, arise, and go to the buddha realm of Sahā!

source: ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་གནོད་པ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། སྟོབས་དང་བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་ཀྱང་ཞུས་ལ།
en: Present my words to the thus-gone Śākyamuni. Ask him if he has any ills or problems and whether he is healthy and well.

source: དེ་ལ་འདི་སྐད་དུ། ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མ་མཆིས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་གདུང་བ་མེད་པ་ཞེས་བགྱི་བ་མཆིས་སོ།
en: Tell him, ‘In the eastern direction, beyond countless buddha realms as numerous as the grains of sand in the Ganges, there is a world called Absence of Torment.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་ཅེས་བགྱི་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: In that buddha realm, the thus-gone Campaka Color resides, thrives, lives well, and teaches the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་བདག་དེ་ནས་འདིར་བཅོམ་ལྡན་འདས་ལ་ཡོངས་སུ་ཞུ་བའི་སླད་དུ་བཏང་བ་ལགས་ན།
en: That thus-gone one has sent me here to ask these questions to the Blessed One:

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་བསྙུང་བ་མི་མངའ་ལགས་སམ། གནོད་པ་ཆུང་ངམ།
en: “Respected Blessed One, are you well and free from ills?

source: ཁྱོད་ཀྱི་འཁོར་བྲོ་འཚལ་བ་མ་མཆིས་ལགས་སམ། གནོད་པ་ཆུང་ངམ།
en: Are the members of your retinue comfortable and in good health?

source: དམ་པའི་ཆོས་ཉན་པར་འཚལ་བ་དག་ལགས་སམ།
en: Are they eager to listen to the sacred Dharma?

source: ཇི་ལྟར་ཐོས་པ་བཞིན་དུ་ཆོས་དང་ལྡན་པ་ལགས་སམ།
en: Do they apply the Dharma in the way they hear it?

source: ཆོས་དེ་ལ་ནན་ཏན་སྙིང་པོར་བགྱིད་པ་ལགས་སམ།
en: Do they persevere in the Dharma?

source: ཆོས་ཀྱིས་གནས་པ་དང་ལྡན་པར་གནས་ལགས་སམ།
en: Do they abide by the Dharma?

source: ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་བདུད་ཀྱི་ཡུལ་དང་། ཀླུའི་ཡུལ་བཅོམ་ལགས་སམ།
en: Are the domains of the māras and the nāgas subjugated in your buddha realm?

source: སངས་རྒྱས་གཅིག་གི་ཡུལ་ལགས་སམ།
en: Is this the domain of the Buddha alone?

source: འདིར་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་ཐོགས་པ་མ་མཆིས་པར་བསྐོར་བར་མཛད་ལགས་སམ། གང་ལ་ལ་སངས་རྒྱས་ཀྱི་ཡུལ་འདིར་ཆོས་མ་ལགས་པའི་འཁོར་ལོ་སྐོར་བ་དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་དེས་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་འདི་ལ་དད་པ་གནང་སྟེ།
en: Are you turning the Dharma wheel without obstruction in this place?” For those who turn a wheel of non-Dharma in this buddha realm, the thus-gone Campaka Color instills faith by granting the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings.

source: དེ་ནས་ཀྱང་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་མཐུ་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: He confers upon them this powerful and beneficial dhāraṇī mantra that accords with the truth.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བགྱིད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བགྱིད་པ། གཟུགས་མེད་པའི་འདོད་ཆགས་ཀུན་ཏུ་ཟད་པར་བགྱིད་པ་ནས། མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པའི་བར་བགྱིད་པ་དང་། སྡུག་བསྔལ་གྱི་ཕུང་པོའི་ཁུར་འདོར་བར་བགྱིད་པ་འདི་བསྐུར་ལགས་སོ་ཞེས་གསོལ་ཅིག །
en: It exhausts all forms of attachment associated with the desire realm, the form realm, and the formless realm. [. . .] It overcomes all the dense darkness of ignorance, and it removes the burden of suffering.’ ”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཡོན་ཏན་དང་། ཕན་ཡོན་དང་བཅས་པ་བདག་གིས་བཟུང་ལགས་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་མཆི་བ་ལ་འཇིགས་པ་འབའ་ཞིག་མཆིས་ལགས་སོ།
en: The bodhisattva great being Quintessence of the Sun’s Energy then said, “Respected Blessed One, when I consider this beneficial acceptance that accords with the Dharma and is filled with qualities, I am utterly afraid to go to the buddha realm of Sahā!

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why?

source: ད་ལྟར་བཅོམ་ལྡན་འདས་ལས་བདག་གིས་མངོན་དུ་ཐོས་ཤིང་མངོན་དུ་བཟུང་ལགས་ཏེ། འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་ན་སེམས་ཅན་རྣམས་འདོད་ཆགས་ཀྱི་ཤས་ཆེ་བ་དམུས་ལོང་དང་འདྲ་བ་དག་ལགས་ཏེ།
en: Because I have just heard about that realm from the Blessed One, and I am now aware that in the buddha realm of Sahā sentient beings are predominantly under the influence of desire and like blind persons.

source: དེ་ན་བུད་མེད་ཀྱང་གཟུགས་མི་སྡུག་པ་དང་། ཚུལ་དུ་མི་ཤིས་པ་དང་། མཆོག་ཏུ་གཟུགས་ཀྱི་རྒྱགས་པས་དྲེགས་པ་ནས་སེམས་ཅན་རྣམས་བསམ་གཏན་ལ་རབ་ཏུ་སྤྱོད་པ་བགྱིས་པ། མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བ། སྐྱེས་བུ་དམ་པ་མཁས་པ་ཆེན་པོ་དག་ཀྱང་ལྷག་པར་བུད་མེད་ཀྱི་དབང་དུ་འགྱུར་བ་ལགས་སོ།
en: There, the women are unattractive and ugly yet extremely conceited in terms of their appearance. [. . .] Even sacred beings who are great scholars, who have trained in concentration, and who revel in the higher perceptions can be overpowered by women.

source: །བུད་མེད་ཀྱི་ཉེས་པས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཉམས་པ་དག་དང་། ངན་སོང་བ་དག་དང་། སེམས་ཅན་དམྱལ་བའི་བར་འབྱུང་ཞིང་འབྱུང་བར་འགྱུར་བའི་སླད་དུའོ།
en: Through the faults of women, all their roots of virtue will be destroyed, and they will go to the lower realms and be born as hell beings.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་ནི་བདག་གི་དོན་དུ་སྨྲ་བ་མ་ཡིན་ཞིང་བདག་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་མ་ཡིན་ནོ།
en: The blessed thus-gone Campaka Color replied to the bodhisattva great being Quintessence of the Sun’s Energy, “Noble son, you do not speak for your own sake, and you do not act for your own benefit.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྨྲ་བ་ཡིན་ཞིང་ཁྱོད་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ།
en: Noble son, you speak and act for the sake of all sentient beings.

source: །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་འཁོར་ན་དགེ་བསྙེན་དྲི་མ་མེད་པར་གྲགས་པ་ཞེས་བྱ་བ་སྣང་བ་གང་ཡིན་པ་དེ་ཡང་སུ་ཡིན།
en: Noble son, who is the lay practitioner named Vimalakīrti who appears in the buddha realm of Sahā, within the retinue of the thus-gone Śākyamuni?

source: དེ་ནི་ཁྱོད་ཉིད་མ་ཡིན་ནམ།
en: Is that not you?”

source: དེ་ཅང་མི་སྨྲ་བར་གྱུར་ཏོ།
en: He remained silent.

source: །དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་ང་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་གྲངས་མེད་པ་འདིའི་བར་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ལ་ལར་ཁ་ཅིག་ཏུ་ནི་ཚངས་པའི་ལུས་བྱད་དུ་ཀུན་ཏུ་སྣང་ངོ་། །
en: “In that buddha realm and in countless trillions of buddha realms in between, I, the thus-gone Campaka Color, also sometimes manifest in the physical form of Brahmā to ripen beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཁ་ཅིག་ཏུ་ནི་དབང་ཕྱུག་གི་ལུས་བྱད་དུ་ཀུན་ཏུ་སྣང་ངོ་། །ལ་ལར་ནི་དགེ་སྦྱོང་གི་ལུས་བྱད་དང་། ལ་ལར་ནི་བརྒྱ་བྱིན་གྱི་ལུས་བྱད་དང་། ལ་ལར་ནི་ལྷའི་ལུས་བྱད་དང་། ལ་ལར་ནི་ཀླུའི་དབང་པོའི་ལུས་བྱད་དང་། ལ་ལར་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་ལུས་བྱད་དང་། ལ་ལར་ནི་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་ལུས་བྱད་དང་། ལ་ལར་ནི་མི་འམ་ཅིའི་དབང་པོའི་ལུས་བྱད་དང་། ལ་ལར་ནི་ཤེད་ལས་སྐྱེས་ཀྱི་དབང་པོའི་ལུས་བྱད་དང་། ལ་ལར་ནི་རང་སངས་རྒྱས་ཀྱི་ལུས་བྱད་དང་། ལ་ལར་ནི་ཉན་ཐོས་ཀྱི་ལུས་བྱད་དང་། ལ་ལར་ནི་རྒྱལ་རིགས་ཀྱི་ལུས་བྱད་དང་། ལ་ལར་ནི་བྲམ་ཟེའི་ལུས་བྱད་དང་། ལ་ལར་ནི་ཁྱིམ་བདག་གི་ལུས་བྱད་དང་། ལ་ལར་ནི་བུད་མེད་ཀྱི་ལུས་བྱད་དང་། ལ་ལར་ནི་ཁྱེའུའི་ལུས་བྱད་དང་། ལ་ལར་ནི་བུ་མོའི་ལུས་བྱད་དང་། ལ་ལར་ནི་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་ལུས་བྱད་དང་། ལ་ལར་ནི་ཡི་དགས་ཀྱི་ལུས་བྱད་དང་། ལ་ལར་ནི་སེམས་ཅན་དམྱལ་བའི་ལུས་བྱད་དུ་ཀུན་ཏུ་སྣང་ངོ་།
en: To ripen beings, I sometimes manifest in the physical form of Īśvara, of a spiritual practitioner, of Śakra, of a god, of the lord of the nāgas, of the lord of the asuras, of the lord of the garuḍas, of the lord of kinnaras, of the lord of humans, of a solitary buddha, of a hearer, of a member of the kṣatriya class, of a brāhmaṇa, of a householder, of a woman, of a boy, of a girl, of an animal, of a preta, and of a hell being.

source: །དེ་ལྟ་མོད་ཀྱི་འཁོར་འདི་ན་གང་དག་ང་དང་ཐབས་ཅིག་ལྷན་ཅིག་ཏུ་སྙོམས་པར་འཇུག་པར་མཛད་ཅིང་བཞེངས་པར་ཡང་མཛད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་ཁྲི་ཡོད་དོ།
en: “There are eighty thousand bodhisattva great beings in this retinue who are absorbed in attainment and arise from that state together with me.

source: །འཁོར་འདི་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་བློ་གཡོ་བ་དག་དང་། བློ་རྒྱུད་རྣམ་པར་མི་གནས་པ་དག་ཀྱང་ཡོད་དེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་བལྟ་བ་དང་། ཕྱག་འཚལ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། འདུས་པ་ཆེན་པོ་དེ་ལ་ཡང་བལྟ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལས་ཀྱང་འདུས་པ་ཆེན་པོ་མཉན་པར་མཆོག་ཏུ་འདོད་པར་གྱུར་ཏོ།
en: In this retinue, there are also some bodhisattvas whose minds are wavering and unsettled, and they strongly wish to behold the thus-gone Śākyamuni, to pay homage to him, to serve him, and to behold his great assembly. They also strongly wish to hear The Great Assembly from the thus-gone Śākyamuni.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་ང་ཁོ་ན་དང་ཐབས་ཅིག་ཏུ་དེ་ཉིད་དུ་འདོང་བར་འདོད་དེ།
en: However, those bodhisattvas only want to go there together with me.

source: དེར་དེ་དག་འདོད་པའི་འདོད་ཆགས་ཀྱི་རྒྱུས་སླུ་བར་གྱུར་ན་མི་རུང་ཞིང་དེར་ངའི་སྐྱེས་བུ་དམ་པ་མ་ཡིན་པའི་བྱེད་པ་འགྲོ་བར་གྱུར་ན་མི་རུང་བས། དེ་དག་གི་དོན་དུ་ངས་བཤད་དོ།
en: It would be improper if they were deceived by sensual desires there and if they were to go there and act in ways that make them unworthy to be my followers, so I will now speak for their benefit.”

source: །ཡང་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་མ་འཇིགས་ཤིག་མ་འཇིགས་ཤིག །
en: The thus-gone Campaka Color then said to the bodhisattva Quintessence of the Sun’s Energy, “Noble son do not be afraid! Do not be afraid!

source: སྐྱེས་བུ་དམ་པ་ཁྱེད་ལ་འདི་ལྟ་སྟེ། གཟུངས་སྔགས་གང་གིས་སྲིད་པ་གསུམ་གྱི་བཙོན་རར་ཐམས་ཅད་དུ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་ཅན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་རྣམ་པར་ཐར་པའི་སྒོ་ལ་རེག་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དང་། མི་གཡོ་བའི་ཏིང་ངེ་འཛིན་ལ་འཇུག་པ་དང་། མགོ་མཉམ་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་བའི་གཟུངས་སྔགས་ཉི་མ་སྣང་བའི་པད་མ་ཞེས་བྱ་བ་ལུས་ཀྱི་ཚོར་བ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ།
en: Sacred being, I will confer upon you the dhāraṇī mantra called lotus of sunlight, through which one will develop intense aversion for the entire prison of the three realms; one will reach, perfect, and abide by the gateway of liberation, the absorption of the absence of marks; one will enter unwavering absorption; and one will thoroughly pass into nirvāṇa.

source: ལུས་ཀྱི་འདུ་ཤེས་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ། དུལ་བའི་ས་སྒྲུབ་པར་བྱེད་པ། རྣམ་པར་གྲོལ་བ་སྒྲུབ་པར་བྱེད་པ།
en: This dhāraṇī mantra accomplishes all physical feelings and perceptions as well as the level of gaining control and liberation.

source: སྲིད་པའི་རྒྱ་མཚོ་ཡོངས་སུ་གཅོད་པ་སྒྲུབ་པར་བྱེད་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་གི་གགས་ལྡོག་པ་སྒྲུབ་པར་བྱེད་པ།
en: It accomplishes the elimination of the ocean of saṃsāra and the removal of obstructions to the lineage of the Three Jewels.

source: བྱམས་པ་ཆེན་པོ་སྒྲུབ་པར་བྱེད་པ། སྙིང་རྗེ་ཆེན་པོ་སྒྲུབ་པར་བྱེད་པ། ཤེས་རབ་རྣམ་པར་གྲོལ་བ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ། བདུད་བཞི་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་འདུལ་བ་སྒྲུབ་པར་བྱེད་པ། ཟད་པ་ཤེས་པ་དང་མི་སྐྱེ་བ་ཤེས་པ་སྒྲུབ་པར་བྱེད་པ། ལོངས་སྤྱོད་དང་། ཚེའི་འདུ་བྱེད་ཐམས་ཅད་དང་། ཞི་བ་དང་། གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྒྲུབ་པར་བྱེད་པ་ངས་སྦྱིན་པར་མཛད་དོ།
en: It accomplishes great love, great compassion, liberated insight, the subjugation of all māras and enemies, the knowledge of exhaustion, and the knowledge of the unborn, as well as enjoyment, life energy, peace, and lasting nirvāṇa.

source: །རིགས་ཀྱི་བུ་གང་ལ་ལ་ཉི་མ་སྣང་བའི་གཟུངས་སྔགས་འདི་སེམས་རྩེ་གཅིག་པས་ཉན་པར་བྱེད་ན། འདོད་ཆགས་ལ་སོགས་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྲབ་མོར་བྱེད་དོ། །འཆི་བའི་དུས་བྱས་ནས་ཀྱང་ལྷ་རྣམས་ཀྱི་ནང་དུ་ཚེ་རབས་བདུན་འཁོར་བར་བྱེད་ཅིང་ཚེ་རབས་དྲན་པར་ཡང་འགྱུར་ལ།
en: “Noble son, all afflictions, such as desire, will diminish in those who listen one-pointedly to this sunlight dhāraṇī mantra, and after they die they will circle for seven lifetimes among the gods.

source: དེར་འདོད་པ་རྣམས་ཀྱིས་ཀྱང་གོས་པར་མི་འགྱུར་རོ།
en: There they will remember their former lives and will not be sullied by desires.

source: །དེ་རྣམས་ཀྱི་ནང་དུ་ལྷའི་དྲང་སྲོང་དུ་འགྱུར་ཞིང་ལྷ་རྣམས་ཀྱིས་མཆོད་པའི་འོས་སུ་འགྱུར་རོ།
en: They will become sages among the gods, worthy to be worshiped by them.

source: །དེ་དེ་ནས་ཤི་འཕོས་ནས་མི་རྣམས་ཀྱི་ནང་དུ་ཚེ་རབས་བདུན་འཁོར་བར་བྱེད་ཅིང་འདིར་འདོད་པ་རྣམས་ཀྱིས་རྗེས་སུ་གོས་པར་ཡང་མི་འགྱུར་རོ།
en: After they die, they will circle for seven lifetimes among the humans, without being sullied by desires.

source: །འདིར་མི་རྣམས་ཀྱི་ནང་དུ་མིའི་དྲང་སྲོང་དུ་འགྱུར་ཞིང་ལྷ་དང་མི་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། མཆོད་པའི་འོས་སུ་འགྱུར་རོ།
en: They will become sages among the humans, worthy to be revered and worshiped by all the gods and humans.

source: །གང་ལ་ལ་ཉི་མ་སྣང་བའི་གཟུངས་སྔགས་སེམས་རྩེ་གཅིག་པས་ལན་བདུན་གྱི་བར་དུ་ཉན་པར་བྱེད་ན་དེ་འཆི་བའི་དུས་བྱས་ནས་ལྷ་རྣམས་ཀྱི་ནང་དུ་ལན་བདུན་གྱི་བར་དུ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་འགྱུར་ཞིང་ལྷ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བའི་འོས་དང་མཆོད་པའི་འོས་སུ་འགྱུར་རོ།
en: Those who listen one-pointedly to this sunlight dhāraṇī mantra seven times will, after they die, be born seven times among the gods, as sages endowed with the five higher perceptions and worthy to be revered and worshiped by all the gods.

source: །དེ་འདིར་མི་རྣམས་ཀྱི་ནང་དུ་ལན་བདུན་དུ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་འགྱུར་ཞིང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། མི་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཕྱག་བྱ་བའི་འོས་དང་། མཆོད་པའི་འོས་སུ་འགྱུར་རོ།
en: Then, they will be born seven times among the humans, as sages endowed with the five higher perceptions and worthy to be revered and worshiped by the gods, the nāgas, the yakṣas, the asuras, the humans, and the nonhumans.

source: །རིགས་ཀྱི་བུ་གང་ལ་ལ་ལྷ་རྣམས་ཀྱི་ནང་དུ་ཡང་ལྷའི་འདུས་པ་རྣམས་ལ་གཟུངས་སྔགས་ཉི་མ་སྣང་བའི་པད་མ་ཞེས་བྱ་བ་འདི་ལན་བདུན་དུ་རྗོད་པར་བྱེད་ལ། དེ་དག་ཀྱང་སེམས་རྩེ་གཅིག་པས་ཉན་པར་བྱེད་ན་ལྷ་དང་ལྷ་མོ་དེ་དག་ཐམས་ཅད་ཀྱང་འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་ཐམས་ཅད་ལ་མི་ལྟ་བའི་སེམས་དང་ལྡན་པར་འགྱུར་ཞིང་། བསམ་གཏན་ལ་མངོན་པར་དགའ་བར་འགྱུར་རོ། །
en: Noble son, all the gods and goddesses who recite seven times this dhāraṇī mantra lotus of sunlight to gatherings of gods in the god realms and listen to it one-pointedly will disregard all the pleasures of the five senses and delight in concentration.

source: གལ་ཏེ་ལ་ལ་འདིར་རྒྱལ་པོ་རྣམས་སམ། རྒྱལ་རིགས་རྣམས་སམ། བྲམ་ཟེ་རྣམས་སམ། རྗེའུ་རིགས་རྣམས་སམ། དམངས་རིགས་རྣམས་ཀྱི་རྣ་གུང་དུ་ལན་བདུན་དུ་རྗོད་པར་བྱེད་ལ། གལ་ཏེ་དེ་དག་ཀྱང་སེམས་རྩེ་གཅིག་པས་ཉན་པར་བྱེད་ན་དེ་དག་ཐམས་ཅད་འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་ཐམས་ཅད་ལ་མི་ལྟ་བའི་སེམས་དང་ལྡན་པ་དང་། བསམ་གཏན་ལ་མངོན་པར་དགའ་བར་འགྱུར་རོ།
en: In this world, if someone whispers it seven times in the ears of kings, of members of the kṣatriya class, or of brāhmaṇas, vaiśyas, or śūdras, and if they listen to it one-pointedly, they will all disregard all the pleasures of the five senses and delight in concentration.

source: །རིགས་ཀྱི་བུ་བུད་མེད་གང་ལ་ལ་གཟུངས་སྔགས་ཉི་མ་སྣང་བའི་པད་མ་ཞེས་བྱ་བ་འདི་ཉན་པར་བྱེད་ཅིང་ཉིན་ཞག་བདུན་དུ་ལས་གཞན་མི་བྱེད་པར་རྣམ་པར་སེམས་པར་བྱེད་དམ། ལྕེས་ཁ་ཏོན་དུ་བྱེད་ན་དེའི་རིས་འཐུན་པ་ལ་འདོད་ཆགས་ལ་སོགས་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་བསྲབས་པར་འགྱུར་རོ།
en: Noble son, a woman who listens to this dhāraṇī mantra lotus of sunlight and contemplates it or recites it for seven days without doing anything else will, accordingly, experience a diminution of all her afflictions, such as desire.

source: །འདི་ནི་དེའི་བུད་མེད་འཐོབ་པའི་ཐ་མ་ཡིན་ནོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: It will be the last time she is born with a female body, and she will not regress on the path to unsurpassed and perfect awakening.

source: །དེ་ཕྱིས་ཀྱང་བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་རང་གི་སྨོན་ལམ་མ་གཏོགས་པར་འཁོར་བ་ན་འཁོར་བའི་ཚེ་བུད་མེད་འཐོབ་པ་རྙེད་པར་མི་འགྱུར་རོ།
en: From then on, until she reaches unsurpassed parinirvāṇa, she will never again be born with a female body while circling in saṃsāra—unless she wishes to.

source: །རིགས་ཀྱི་བུ་གང་ལ་ལ་གཟུངས་སྔགས་ཉི་མ་སྣང་བའི་པད་མ་ཞེས་བྱ་བ་འདིས་ལན་བདུན་དུ་རྩི་གྲང་མོ་ལས་བྱ་བས་ནས་རྔ་བོ་ཆེའམ། དུང་ལ་བྱུགས་ནས། རྔ་བོ་ཆེ་དེ་རྡུང་བར་བྱེད་དམ། དུང་འབུད་པར་བྱེད་ན་གང་དང་གང་དུ་དེ་དག་གི་སྒྲ་འགྲོ་བ་དེ་དང་དེར་མི་རྣམས་ལ་བྱད་སྟེམས་ཐམས་ཅད་ཀྱི་རྒྱུ་མེད་པར་འགྱུར་རོ།
en: Noble son, if people create a cooling balm by reciting this dhāraṇī mantra lotus of sunlight seven times, anoint great drums or conch shells with it, and then beat these drums or blow in these conch shells, the potency of the curses directed at humans will be annihilated anywhere the sound reaches.

source: །དེར་སྨན་གྱི་སྦྱོར་བ་འགྲོ་བ་དང་། ཕོ་ཉ་དང་། ཡིག་འབྲུ་དང་། ཡིད་ལ་བྱེད་པ་དང་། ལུས་འགྱུར་བ་དང་། ཚུལ་འཆོས་པ་དང་། འཆིང་བ་དང་། ལུས་དང་། སྙིང་གི་ཀུན་ཏུ་གདུང་བ་མཐོང་བར་མི་འགྱུར་རོ། །ལས་སྒྲུབ་པ་མེད་པར་འབྲས་བུ་འགྲུབ་པར་འགྱུར་ཏེ། རིགས་ཀྱི་བུ་གཟུངས་སྔགས་ཉི་མ་སྣང་བའི་པད་མ་ཞེས་བྱ་བ་འདི་ནི་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ་ཡིན་ནོ།
en: No torments related to medicines, envoys, words, mental activity, physical transformation, pretense, bondage, the body, or the heart will be experienced, and fruits will manifest without doing any work. Noble son, the dhāraṇī mantra lotus of sunlight thus possesses great miraculous powers.
